// Назначение переменных, создание условной конструкции (if/else)
package com.itproger.homework;

public class FirstHomework {
    public static void main(String[] args) {
//        int x = 1; // Заведение переменной x, присвоение значения = 1
//        int y = 2; // Заведение переменной y, присвоение значения = 2
//        System.out.println(x + y); // Вывод в консоли результа сложения x + y

        int x = 2; // Заведение переменной x, присвоение значения = 1
        int y = 1; // Заведение переменной y, присвоение значения = 2
        if (x > y) { // Условная конструкця (Если x больше y, вывести в консоль то что ниже
            System.out.println("X больше Y"); // Вывод в консоли результа уровнения
        } else { // Условная конструкця (Если вывод оператора if не верно вывести в консоль то что ниже
            System.out.println("X меньше Y"); // Вывод в консоли результа сложения x + y
        }
    }
}
